import React, { Component } from "react";
import './HowToWork.css';
import { Container } from 'react-bootstrap';


export default class HowToWork extends Component {

    render() {


        return (
            <Container fluid>
                <div className="right-out">
                    <h5 className="about-h3">Слава Україні! Героям слава! </h5>
                    <p>Шановні співвітчизники, доброго часу доби!</p>
                    <p>Перед використанням застосунку Forecast автор зауважує: засосунок Forecast НЕ Є ОФІЦІЙНИМ ДЖЕРЕЛОМ отримання розрахункових даних, а лише допомогає оперативно розрахувати та візуалізувати на карті місце та район аварії, глибину поширення первинної та вторинної хмар, площу ЗМХЗ.</p>
                    <p>Перед початком роботи зайдіть на головну сторінку з картою місцевості. Розрахунки треба розпочинати із заповнення вихідних даних: вибору хімічної речовини, ступені вертикальної стійкості, агрегатного стану та ін. Для коректної роботи застосунку, перед тим, як натиснути кнопку "Розрахувати" усі поля "Вихідних даних" повинні бути заповнені. Висота піддону повинна бути вказана 0 - якщо піддон, або обвалування відсутні. Не забудьте вказати напрямок вітру.</p>
                    <p>Значення коефіцієнту впливу місцевості слід визначати виходячи із значення комплексного показника (додатки 5 та 6 методики). Зазвичай, для лісисто-степового виду рослинності та рівнінно-хвилястого виду рельєфу цей показник складає 0.5.</p>
                    <p>Після заповнення полів у розділі "Вихідні дані" натисніть кнопку "Розрахувати". У розділі "Результати розрахунків" з'являться розрахункові дані. Також можна буде переглянути "Проміжні розрахунки" та "Довідкову інформацію про НХР".</p>
                    <p>Далі - робота з картою. З допомогою "мишки" виберіть на карті місце виникнення аварії та натисніть ліву клавішу. На карті відобразяться ЗМХЗ та первинна і вторинна хмари. Якщо клікнути на них лівою кнопкою миші,  відобразяться основні розрахунки.</p>
                    <p> Після накладання зон аварії на карту можна продовжити розрахунки щодо можливих втрат, заповнити відповідні форми у розділі "Для розрахунку можливих втрат" та натиснути "Розрахувати".</p>
                    <p>Нагадую: </p>
                    <ul>
                        <li>
                            для використання у офіційних документах розрахунків, щодо наслідків виливу (викиду) небезпечних хімічних речовин під час аварій на хімічно небезпечних об’єктах і транспорті, будь ласка, користуйтеся наказом МВС України від 29.11.2019 № 1000 "Про затвердження Методики..."</li>
                        <li>для визначення фактичної ЗХЗ отримані розрахункові дані уточнюються шляхом проведення хімічної розвідки.</li>
                    </ul>
                    <p>З повагою та надією на розуміння, автор - Віктор Кржемінський. <a href="mailto:krzheminsky@ukr.net">krzheminsky@ukr.net</a> </p>
                    <h5 className="about-h3">Все буде Україна! </h5>
                </div >
            </Container>
        );
    }
}